MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12B0AGN20000/mcu.h
/*******************************************************************************
* HWWDT_MODULE
*******************************************************************************/
typedef struct stc_hwwdt_wdg_ctl_field
{
        __IO  uint32_t  INTEN                    :1;
        __IO  uint32_t  RESEN                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_hwwdt_wdg_ctl_field_t;

typedef struct stc_hwwdt_wdg_ris_field
{
        __IO  uint32_t  RIS                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_hwwdt_wdg_ris_field_t;

/*******************************************************************************
* I2CSLAVE_MODULE
*******************************************************************************/
typedef struct stc_i2cslave_ibssr_field
{
        __IO  uint16_t  BB                       :1;
        __IO  uint16_t  SPC                      :1;
        __IO  uint16_t  RSC                      :1;
        __IO  uint16_t  ACT                      :1;
        __IO  uint16_t  TRX                      :1;
        __IO  uint16_t  RSA                      :1;
        __IO  uint16_t  RACK                     :1;
        __IO  uint16_t  FBT                      :1;
        __IO  uint16_t  TDRE                     :1;
        __IO  uint16_t  RDRF                     :1;
        __IO  uint16_t  INT                      :1;
        __IO  uint16_t  RESERVED0                :5;
} stc_i2cslave_ibssr_field_t;

typedef struct stc_i2cslave_ibscr_field
{
    union {
        struct {
            __IO  uint16_t  TIE                  :1;
            __IO  uint16_t  RIE                  :1;
            __IO  uint16_t  INTE                 :1;
            __IO  uint16_t  CNDE                 :1;
            __IO  uint16_t  WSEL                 :1;
            __IO  uint16_t  ACKE                 :1;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  RSVEN                :1;
            __IO  uint16_t  NFCNT                :2;
            __IO  uint16_t  RESERVED2            :6;
        };
        struct {
            __IO  uint16_t  RESERVED1            :8;
            __IO  uint16_t  NFCNT0               :1;
            __IO  uint16_t  NFCNT1               :1;
            __IO  uint16_t  RESERVED3            :6;
        };
    };
} stc_i2cslave_ibscr_field_t;

typedef struct stc_i2cslave_ibsadr_field
{
    union {
        struct {
            __IO   uint8_t  SA                   :7;
            __IO   uint8_t  SAEN                 :1;
        };
        struct {
            __IO   uint8_t  SA0                  :1;
            __IO   uint8_t  SA1                  :1;
            __IO   uint8_t  SA2                  :1;
            __IO   uint8_t  SA3                  :1;
            __IO   uint8_t  SA4                  :1;
            __IO   uint8_t  SA5                  :1;
            __IO   uint8_t  SA6                  :1;
            __IO   uint8_t  RESERVED0            :1;
        };
    };
} stc_i2cslave_ibsadr_field_t;

typedef struct stc_i2cslave_ibsmskr_field
{
    union {
        struct {
            __IO   uint8_t  SM                   :7;
            __IO   uint8_t  EN                   :1;
        };
        struct {
            __IO   uint8_t  SM0                  :1;
            __IO   uint8_t  SM1                  :1;
            __IO   uint8_t  SM2                  :1;
            __IO   uint8_t  SM3                  :1;
            __IO   uint8_t  SM4                  :1;
            __IO   uint8_t  SM5                  :1;
            __IO   uint8_t  SM6                  :1;
            __IO   uint8_t  RESERVED0            :1;
        };
    };
} stc_i2cslave_ibsmskr_field_t;

typedef struct stc_i2cslave_ibsdstupr_field
{
    union {
        struct {
            __IO   uint8_t  SETUP                :8;
        };
        struct {
            __IO   uint8_t  SETUP0               :1;
            __IO   uint8_t  SETUP1               :1;
            __IO   uint8_t  SETUP2               :1;
            __IO   uint8_t  SETUP3               :1;
            __IO   uint8_t  SETUP4               :1;
            __IO   uint8_t  SETUP5               :1;
            __IO   uint8_t  SETUP6               :1;
            __IO   uint8_t  SETUP7               :1;
        };
    };
} stc_i2cslave_ibsdstupr_field_t;

typedef struct stc_i2cslave_ibstdr_field
{
    union {
        struct {
            __IO   uint8_t  TDR                  :8;
        };
        struct {
            __IO   uint8_t  TDR0                 :1;
            __IO   uint8_t  TDR1                 :1;
            __IO   uint8_t  TDR2                 :1;
            __IO   uint8_t  TDR3                 :1;
            __IO   uint8_t  TDR4                 :1;
            __IO   uint8_t  TDR5                 :1;
            __IO   uint8_t  TDR6                 :1;
            __IO   uint8_t  TDR7                 :1;
        };
    };
} stc_i2cslave_ibstdr_field_t;

typedef struct stc_i2cslave_ibsrdr_field
{
    union {
        struct {
            __IO   uint8_t  RDR                  :8;
        };
        struct {
            __IO   uint8_t  RDR0                 :1;
            __IO   uint8_t  RDR1                 :1;
            __IO   uint8_t  RDR2                 :1;
            __IO   uint8_t  RDR3                 :1;
            __IO   uint8_t  RDR4                 :1;
            __IO   uint8_t  RDR5                 :1;
            __IO   uint8_t  RDR6                 :1;
            __IO   uint8_t  RDR7                 :1;
        };
    };
} stc_i2cslave_ibsrdr_field_t;

typedef struct stc_i2cslave_ibsscr_field
{
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  SPCC                     :1;
        __IO  uint16_t  RSCC                     :1;
        __IO  uint16_t  RESERVED1                :7;
        __IO  uint16_t  INTC                     :1;
        __IO  uint16_t  RESERVED2                :5;
} stc_i2cslave_ibsscr_field_t;

typedef struct stc_i2cslave_ibsssr_field
{
        __IO  uint16_t  RESERVED0                :8;
        __IO  uint16_t  TDRES                    :1;
        __IO  uint16_t  RESERVED1                :7;
} stc_i2cslave_ibsssr_field_t;

