MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12B0AGN20000/mcu.h
/*******************************************************************************
* MFS_LIN_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t SMR;
        stc_mfs_lin_smr_field_t SMR_f;
    };
    union {
        __IO  uint8_t SCR;
        stc_mfs_lin_scr_field_t SCR_f;
    };
        __IO  uint8_t RESERVED51[2];
    union {
        __IO  uint8_t ESCR;
        stc_mfs_lin_escr_field_t ESCR_f;
    };
    union {
        __IO  uint8_t SSR;
        stc_mfs_lin_ssr_field_t SSR_f;
    };
        __IO  uint8_t RESERVED52[2];
    union {
        __IO uint16_t RDR;
        stc_mfs_lin_rdr_field_t RDR_f;
        struct {
            __IO  uint8_t RDRL;
            __IO  uint8_t RDRH;
        };
        __IO uint16_t TDR;
        stc_mfs_lin_tdr_field_t TDR_f;
        struct {
            __IO  uint8_t TDRL;
            __IO  uint8_t TDRH;
        };
    };
        __IO  uint8_t RESERVED53[2];
    union {
        __IO uint16_t BGR;
        stc_mfs_lin_bgr_field_t BGR_f;
        struct {
            __IO  uint8_t BGRL;
            __IO  uint8_t BGRH;
        };
    };
        __IO  uint8_t RESERVED54[6];
    union {
        __IO uint16_t FCR;
        stc_mfs_lin_fcr_field_t FCR_f;
        struct {
            __IO  uint8_t FCRL;
            __IO  uint8_t FCRH;
        };
    };
        __IO  uint8_t RESERVED55[2];
    union {
        __IO  uint8_t FBYTE1;
        stc_mfs_lin_fbyte1_field_t FBYTE1_f;
    };
    union {
        __IO  uint8_t FBYTE2;
        stc_mfs_lin_fbyte2_field_t FBYTE2_f;
    };
} FM_MFS_LIN_TypeDef, FM0P_MFS_LIN_TypeDef;

/*******************************************************************************
* MFS_UART_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t SMR;
        stc_mfs_uart_smr_field_t SMR_f;
    };
    union {
        __IO  uint8_t SCR;
        stc_mfs_uart_scr_field_t SCR_f;
    };
        __IO  uint8_t RESERVED56[2];
    union {
        __IO  uint8_t ESCR;
        stc_mfs_uart_escr_field_t ESCR_f;
    };
    union {
        __IO  uint8_t SSR;
        stc_mfs_uart_ssr_field_t SSR_f;
    };
        __IO  uint8_t RESERVED57[2];
    union {
        __IO uint16_t RDR;
        stc_mfs_uart_rdr_field_t RDR_f;
        struct {
            __IO  uint8_t RDRL;
            __IO  uint8_t RDRH;
        };
        __IO uint16_t TDR;
        stc_mfs_uart_tdr_field_t TDR_f;
        struct {
            __IO  uint8_t TDRL;
            __IO  uint8_t TDRH;
        };
    };
        __IO  uint8_t RESERVED58[2];
    union {
        __IO uint16_t BGR;
        stc_mfs_uart_bgr_field_t BGR_f;
        struct {
            __IO  uint8_t BGRL;
            __IO  uint8_t BGRH;
        };
    };
        __IO  uint8_t RESERVED59[6];
    union {
        __IO uint16_t FCR;
        stc_mfs_uart_fcr_field_t FCR_f;
        struct {
            __IO  uint8_t FCRL;
            __IO  uint8_t FCRH;
        };
    };
        __IO  uint8_t RESERVED60[2];
    union {
        __IO  uint8_t FBYTE1;
        stc_mfs_uart_fbyte1_field_t FBYTE1_f;
    };
    union {
        __IO  uint8_t FBYTE2;
        stc_mfs_uart_fbyte2_field_t FBYTE2_f;
    };
} FM_MFS_UART_TypeDef, FM0P_MFS_UART_TypeDef;

/*******************************************************************************
* MFSI2S_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t CNTLREG;
        stc_mfsi2s_cntlreg_field_t CNTLREG_f;
        struct {
            __IO  uint8_t CNTLREGL;
            __IO  uint8_t CNTLREGH;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t I2SCLK;
        stc_mfsi2s_i2sclk_field_t I2SCLK_f;
        struct {
            __IO  uint8_t I2SCLKL;
            __IO  uint8_t I2SCLKH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO  uint8_t I2SRST;
        stc_mfsi2s_i2srst_field_t I2SRST_f;
    };
    union {
        __IO  uint8_t I2SST;
        stc_mfsi2s_i2sst_field_t I2SST_f;
    };
} FM_MFSI2S_TypeDef, FM0P_MFSI2S_TypeDef;

/*******************************************************************************
* MTB_DWT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t CMP_ADDR_START;
        stc_mtb_dwt_cmp_addr_start_field_t CMP_ADDR_START_f;
        struct {
          union {
            __IO uint16_t CMP_ADDR_STARTL;
            struct {
              __IO uint8_t CMP_ADDR_STARTLL;
              __IO uint8_t CMP_ADDR_STARTLH;
            };
          };
          union {
            __IO uint16_t CMP_ADDR_STARTH;
            struct {
              __IO uint8_t CMP_ADDR_STARTHL;
              __IO uint8_t CMP_ADDR_STARTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CMP_DATA_START;
        stc_mtb_dwt_cmp_data_start_field_t CMP_DATA_START_f;
        struct {
          union {
            __IO uint16_t CMP_DATA_STARTL;
            struct {
              __IO uint8_t CMP_DATA_STARTLL;
              __IO uint8_t CMP_DATA_STARTLH;
            };
          };
          union {
            __IO uint16_t CMP_DATA_STARTH;
            struct {
              __IO uint8_t CMP_DATA_STARTHL;
              __IO uint8_t CMP_DATA_STARTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CMP_MASK_START;
        stc_mtb_dwt_cmp_mask_start_field_t CMP_MASK_START_f;
        struct {
          union {
            __IO uint16_t CMP_MASK_STARTL;
            struct {
              __IO uint8_t CMP_MASK_STARTLL;
              __IO uint8_t CMP_MASK_STARTLH;
            };
          };
          union {
            __IO uint16_t CMP_MASK_STARTH;
            struct {
              __IO uint8_t CMP_MASK_STARTHL;
              __IO uint8_t CMP_MASK_STARTHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t CMP_ADDR_STOP;
        stc_mtb_dwt_cmp_addr_stop_field_t CMP_ADDR_STOP_f;
        struct {
          union {
            __IO uint16_t CMP_ADDR_STOPL;
            struct {
              __IO uint8_t CMP_ADDR_STOPLL;
              __IO uint8_t CMP_ADDR_STOPLH;
            };
          };
          union {
            __IO uint16_t CMP_ADDR_STOPH;
            struct {
              __IO uint8_t CMP_ADDR_STOPHL;
              __IO uint8_t CMP_ADDR_STOPHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CMP_DATA_STOP;
        stc_mtb_dwt_cmp_data_stop_field_t CMP_DATA_STOP_f;
        struct {
          union {
            __IO uint16_t CMP_DATA_STOPL;
            struct {
              __IO uint8_t CMP_DATA_STOPLL;
              __IO uint8_t CMP_DATA_STOPLH;
            };
          };
          union {
            __IO uint16_t CMP_DATA_STOPH;
            struct {
              __IO uint8_t CMP_DATA_STOPHL;
              __IO uint8_t CMP_DATA_STOPHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CMP_MASK_STOP;
        stc_mtb_dwt_cmp_mask_stop_field_t CMP_MASK_STOP_f;
        struct {
          union {
            __IO uint16_t CMP_MASK_STOPL;
            struct {
              __IO uint8_t CMP_MASK_STOPLL;
              __IO uint8_t CMP_MASK_STOPLH;
            };
          };
          union {
            __IO uint16_t CMP_MASK_STOPH;
            struct {
              __IO uint8_t CMP_MASK_STOPHL;
              __IO uint8_t CMP_MASK_STOPHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[4];
    union {
        __IO  uint8_t FCT;
        stc_mtb_dwt_fct_field_t FCT_f;
    };
        __IO  uint8_t RESERVED2[4015];
    union {
        __IO uint32_t PID4;
        stc_mtb_dwt_pid4_field_t PID4_f;
        struct {
          union {
            __IO uint16_t PID4L;
            struct {
              __IO uint8_t PID4LL;
              __IO uint8_t PID4LH;
            };
          };
          union {
            __IO uint16_t PID4H;
            struct {
              __IO uint8_t PID4HL;
              __IO uint8_t PID4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PID5;
        stc_mtb_dwt_pid5_field_t PID5_f;
        struct {
          union {
            __IO uint16_t PID5L;
            struct {
              __IO uint8_t PID5LL;
              __IO uint8_t PID5LH;
            };
          };
          union {
            __IO uint16_t PID5H;
            struct {
              __IO uint8_t PID5HL;
              __IO uint8_t PID5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PID6;
        stc_mtb_dwt_pid6_field_t PID6_f;
        struct {
          union {
            __IO uint16_t PID6L;
            struct {
              __IO uint8_t PID6LL;
              __IO uint8_t PID6LH;
            };
          };
          union {
            __IO uint16_t PID6H;
            struct {
              __IO uint8_t PID6HL;
              __IO uint8_t PID6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PID7;
        stc_mtb_dwt_pid7_field_t PID7_f;
        struct {
          union {
            __IO uint16_t PID7L;
            struct {
              __IO uint8_t PID7LL;
              __IO uint8_t PID7LH;
            };
          };
          union {
            __IO uint16_t PID7H;
            struct {
              __IO uint8_t PID7HL;
              __IO uint8_t PID7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PID0;
        stc_mtb_dwt_pid0_field_t PID0_f;
        struct {
          union {
            __IO uint16_t PID0L;
            struct {
              __IO uint8_t PID0LL;
              __IO uint8_t PID0LH;
            };
          };
          union {
            __IO uint16_t PID0H;
            struct {
              __IO uint8_t PID0HL;
              __IO uint8_t PID0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PID1;
        stc_mtb_dwt_pid1_field_t PID1_f;
        struct {
          union {
            __IO uint16_t PID1L;
            struct {
              __IO uint8_t PID1LL;
              __IO uint8_t PID1LH;
            };
          };
          union {
            __IO uint16_t PID1H;
            struct {
              __IO uint8_t PID1HL;
              __IO uint8_t PID1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PID2;
        stc_mtb_dwt_pid2_field_t PID2_f;
        struct {
          union {
            __IO uint16_t PID2L;
            struct {
              __IO uint8_t PID2LL;
              __IO uint8_t PID2LH;
            };
          };
          union {
            __IO uint16_t PID2H;
            struct {
              __IO uint8_t PID2HL;
              __IO uint8_t PID2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PID3;
        stc_mtb_dwt_pid3_field_t PID3_f;
        struct {
          union {
            __IO uint16_t PID3L;
            struct {
              __IO uint8_t PID3LL;
              __IO uint8_t PID3LH;
            };
          };
          union {
            __IO uint16_t PID3H;
            struct {
              __IO uint8_t PID3HL;
              __IO uint8_t PID3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t CID0;
        stc_mtb_dwt_cid0_field_t CID0_f;
        struct {
          union {
            __IO uint16_t CID0L;
            struct {
              __IO uint8_t CID0LL;
              __IO uint8_t CID0LH;
            };
          };
          union {
            __IO uint16_t CID0H;
            struct {
              __IO uint8_t CID0HL;
              __IO uint8_t CID0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t CID1;
        stc_mtb_dwt_cid1_field_t CID1_f;
        struct {
          union {
            __IO uint16_t CID1L;
            struct {
              __IO uint8_t CID1LL;
              __IO uint8_t CID1LH;
            };
          };
          union {
            __IO uint16_t CID1H;
            struct {
              __IO uint8_t CID1HL;
              __IO uint8_t CID1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t CID2;
        stc_mtb_dwt_cid2_field_t CID2_f;
        struct {
          union {
            __IO uint16_t CID2L;
            struct {
              __IO uint8_t CID2LL;
              __IO uint8_t CID2LH;
            };
          };
          union {
            __IO uint16_t CID2H;
            struct {
              __IO uint8_t CID2HL;
              __IO uint8_t CID2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t CID3;
        stc_mtb_dwt_cid3_field_t CID3_f;
        struct {
          union {
            __IO uint16_t CID3L;
            struct {
              __IO uint8_t CID3LL;
              __IO uint8_t CID3LH;
            };
          };
          union {
            __IO uint16_t CID3H;
            struct {
              __IO uint8_t CID3HL;
              __IO uint8_t CID3HH;
            };
          };
        };
    };
} FM_MTB_DWT_TypeDef, FM0P_MTB_DWT_TypeDef;

