MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12B0AGN20000/mcu.h
/*******************************************************************************
* WC Registers WC
*   Register Definition
*******************************************************************************/
#define FM_WC_WCRD                                *((volatile  uint8_t*)(0x4003A000UL))
#define FM0P_WC_WCRD                              *((volatile  uint8_t*)(0x4003A000UL))
#define FM_WC_WCRL                                *((volatile  uint8_t*)(0x4003A001UL))
#define FM0P_WC_WCRL                              *((volatile  uint8_t*)(0x4003A001UL))
#define FM_WC_WCCR                                *((volatile  uint8_t*)(0x4003A002UL))
#define FM0P_WC_WCCR                              *((volatile  uint8_t*)(0x4003A002UL))
#define FM_WC_CLK_SEL                             *((volatile uint16_t*)(0x4003A010UL))
#define FM0P_WC_CLK_SEL                           *((volatile uint16_t*)(0x4003A010UL))
#define FM_WC_CLK_EN                              *((volatile  uint8_t*)(0x4003A014UL))
#define FM0P_WC_CLK_EN                            *((volatile  uint8_t*)(0x4003A014UL))

/*******************************************************************************
* Available Registers
*******************************************************************************/
/*******************************************************************************
* ADC0
*******************************************************************************/
#define FM0P_ADC_ADCEN_AVAILABLE                  1
#define FM_ADC_ADCEN_AVAILABLE                    1
#define FM0P_ADC_ADCR_AVAILABLE                   1
#define FM_ADC_ADCR_AVAILABLE                     1
#define FM0P_ADC_ADCT_AVAILABLE                   1
#define FM_ADC_ADCT_AVAILABLE                     1
#define FM0P_ADC_ADSR_AVAILABLE                   1
#define FM_ADC_ADSR_AVAILABLE                     1
#define FM0P_ADC_ADSS01_AVAILABLE                 1
#define FM_ADC_ADSS01_AVAILABLE                   1
#define FM0P_ADC_ADSS23_AVAILABLE                 1
#define FM_ADC_ADSS23_AVAILABLE                   1
#define FM0P_ADC_ADST01_AVAILABLE                 1
#define FM_ADC_ADST01_AVAILABLE                   1
#define FM0P_ADC_CMPCR_AVAILABLE                  1
#define FM_ADC_CMPCR_AVAILABLE                    1
#define FM0P_ADC_CMPD_AVAILABLE                   1
#define FM_ADC_CMPD_AVAILABLE                     1
#define FM0P_ADC_PCCR_AVAILABLE                   1
#define FM_ADC_PCCR_AVAILABLE                     1
#define FM0P_ADC_PCFD_AVAILABLE                   1
#define FM_ADC_PCFD_AVAILABLE                     1
#define FM0P_ADC_PCFD_FDAS1_AVAILABLE             1
#define FM_ADC_PCFD_FDAS1_AVAILABLE               1
#define FM0P_ADC_PCIS_AVAILABLE                   1
#define FM_ADC_PCIS_AVAILABLE                     1
#define FM0P_ADC_PFNS_AVAILABLE                   1
#define FM_ADC_PFNS_AVAILABLE                     1
#define FM0P_ADC_PRTSL_AVAILABLE                  1
#define FM_ADC_PRTSL_AVAILABLE                    1
#define FM0P_ADC_SCCR_AVAILABLE                   1
#define FM_ADC_SCCR_AVAILABLE                     1
#define FM0P_ADC_SCFD_AVAILABLE                   1
#define FM_ADC_SCFD_AVAILABLE                     1
#define FM0P_ADC_SCFD_FDAS1_AVAILABLE             1
#define FM_ADC_SCFD_FDAS1_AVAILABLE               1
#define FM0P_ADC_SCIS01_AVAILABLE                 1
#define FM_ADC_SCIS01_AVAILABLE                   1
#define FM0P_ADC_SCIS23_AVAILABLE                 1
#define FM_ADC_SCIS23_AVAILABLE                   1
#define FM0P_ADC_SCTSL_AVAILABLE                  1
#define FM_ADC_SCTSL_AVAILABLE                    1
#define FM0P_ADC_SFNS_AVAILABLE                   1
#define FM_ADC_SFNS_AVAILABLE                     1
#define FM0P_ADC_WCMPCR_AVAILABLE                 1
#define FM_ADC_WCMPCR_AVAILABLE                   1
#define FM0P_ADC_WCMPDH_AVAILABLE                 1
#define FM_ADC_WCMPDH_AVAILABLE                   1
#define FM0P_ADC_WCMPDL_AVAILABLE                 1
#define FM_ADC_WCMPDL_AVAILABLE                   1
#define FM0P_ADC_WCMPSR_AVAILABLE                 1
#define FM_ADC_WCMPSR_AVAILABLE                   1
#define FM0P_ADC_WCMRCIF_AVAILABLE                1
#define FM_ADC_WCMRCIF_AVAILABLE                  1
#define FM0P_ADC_WCMRCOT_AVAILABLE                1
#define FM_ADC_WCMRCOT_AVAILABLE                  1
/*******************************************************************************
* BT0
*******************************************************************************/
#define FM0P_BT_PPG_PRLH_AVAILABLE                1
#define FM_BT_PPG_PRLH_AVAILABLE                  1
#define FM0P_BT_PPG_PRLL_AVAILABLE                1
#define FM_BT_PPG_PRLL_AVAILABLE                  1
#define FM0P_BT_PPG_STC_AVAILABLE                 1
#define FM_BT_PPG_STC_AVAILABLE                   1
#define FM0P_BT_PPG_TMCR_AVAILABLE                1
#define FM_BT_PPG_TMCR_AVAILABLE                  1
#define FM0P_BT_PPG_TMCR2_AVAILABLE               1
#define FM_BT_PPG_TMCR2_AVAILABLE                 1
#define FM0P_BT_PPG_TMR_AVAILABLE                 1
#define FM_BT_PPG_TMR_AVAILABLE                   1
#define FM0P_BT_PWC_DTBF_AVAILABLE                1
#define FM_BT_PWC_DTBF_AVAILABLE                  1
#define FM0P_BT_PWC_STC_AVAILABLE                 1
#define FM_BT_PWC_STC_AVAILABLE                   1
#define FM0P_BT_PWC_TMCR_AVAILABLE                1
#define FM_BT_PWC_TMCR_AVAILABLE                  1
#define FM0P_BT_PWC_TMCR2_AVAILABLE               1
#define FM_BT_PWC_TMCR2_AVAILABLE                 1
#define FM0P_BT_PWM_PCSR_AVAILABLE                1
#define FM_BT_PWM_PCSR_AVAILABLE                  1
#define FM0P_BT_PWM_PDUT_AVAILABLE                1
#define FM_BT_PWM_PDUT_AVAILABLE                  1
#define FM0P_BT_PWM_STC_AVAILABLE                 1
#define FM_BT_PWM_STC_AVAILABLE                   1
#define FM0P_BT_PWM_TMCR_AVAILABLE                1
#define FM_BT_PWM_TMCR_AVAILABLE                  1
#define FM0P_BT_PWM_TMCR2_AVAILABLE               1
#define FM_BT_PWM_TMCR2_AVAILABLE                 1
#define FM0P_BT_PWM_TMR_AVAILABLE                 1
#define FM_BT_PWM_TMR_AVAILABLE                   1
#define FM0P_BT_RT_PCSR_AVAILABLE                 1
#define FM_BT_RT_PCSR_AVAILABLE                   1
#define FM0P_BT_RT_STC_AVAILABLE                  1
#define FM_BT_RT_STC_AVAILABLE                    1
#define FM0P_BT_RT_TMCR_AVAILABLE                 1
#define FM_BT_RT_TMCR_AVAILABLE                   1
#define FM0P_BT_RT_TMCR2_AVAILABLE                1
#define FM_BT_RT_TMCR2_AVAILABLE                  1
#define FM0P_BT_RT_TMR_AVAILABLE                  1
#define FM_BT_RT_TMR_AVAILABLE                    1
/*******************************************************************************
* BTIOSEL03
*******************************************************************************/
#define FM0P_BTIOSEL03_BTSEL0123_AVAILABLE        1
#define FM_BTIOSEL03_BTSEL0123_AVAILABLE          1
/*******************************************************************************
* BTIOSEL47
*******************************************************************************/
#define FM0P_BTIOSEL47_BTSEL4567_AVAILABLE        1
#define FM_BTIOSEL47_BTSEL4567_AVAILABLE          1
/*******************************************************************************
* CLK_GATING
*******************************************************************************/
#define FM0P_CLK_GATING_CKEN0_AVAILABLE           1
#define FM_CLK_GATING_CKEN0_AVAILABLE             1
#define FM0P_CLK_GATING_CKEN1_AVAILABLE           1
#define FM_CLK_GATING_CKEN1_AVAILABLE             1
#define FM0P_CLK_GATING_CKEN2_AVAILABLE           1
#define FM_CLK_GATING_CKEN2_AVAILABLE             1
#define FM0P_CLK_GATING_MRST0_AVAILABLE           1
#define FM_CLK_GATING_MRST0_AVAILABLE             1
#define FM0P_CLK_GATING_MRST1_AVAILABLE           1
#define FM_CLK_GATING_MRST1_AVAILABLE             1
#define FM0P_CLK_GATING_MRST2_AVAILABLE           1
#define FM_CLK_GATING_MRST2_AVAILABLE             1
/*******************************************************************************
* CRC
*******************************************************************************/
#define FM0P_CRC_CRCCR_AVAILABLE                  1
#define FM_CRC_CRCCR_AVAILABLE                    1
#define FM0P_CRC_CRCIN_AVAILABLE                  1
#define FM_CRC_CRCIN_AVAILABLE                    1
#define FM0P_CRC_CRCINIT_AVAILABLE                1
#define FM_CRC_CRCINIT_AVAILABLE                  1
#define FM0P_CRC_CRCR_AVAILABLE                   1
#define FM_CRC_CRCR_AVAILABLE                     1
/*******************************************************************************
* CRG
*******************************************************************************/
#define FM0P_CRG_APBC0_PSR_AVAILABLE              1
#define FM_CRG_APBC0_PSR_AVAILABLE                1
#define FM0P_CRG_APBC1_PSR_AVAILABLE              1
#define FM_CRG_APBC1_PSR_AVAILABLE                1
#define FM0P_CRG_BSC_PSR_AVAILABLE                1
#define FM_CRG_BSC_PSR_AVAILABLE                  1
#define FM0P_CRG_CSV_CTL_AVAILABLE                1
#define FM_CRG_CSV_CTL_AVAILABLE                  1
#define FM0P_CRG_CSV_STR_AVAILABLE                1
#define FM_CRG_CSV_STR_AVAILABLE                  1
#define FM0P_CRG_CSW_TMR_AVAILABLE                1
#define FM_CRG_CSW_TMR_AVAILABLE                  1
#define FM0P_CRG_DBWDT_CTL_AVAILABLE              1
#define FM_CRG_DBWDT_CTL_AVAILABLE                1
#define FM0P_CRG_FCSWD_CTL_AVAILABLE              1
#define FM_CRG_FCSWD_CTL_AVAILABLE                1
#define FM0P_CRG_FCSWH_CTL_AVAILABLE              1
#define FM_CRG_FCSWH_CTL_AVAILABLE                1
#define FM0P_CRG_FCSWL_CTL_AVAILABLE              1
#define FM_CRG_FCSWL_CTL_AVAILABLE                1
#define FM0P_CRG_INT_CLR_AVAILABLE                1
#define FM_CRG_INT_CLR_AVAILABLE                  1
#define FM0P_CRG_INT_ENR_AVAILABLE                1
#define FM_CRG_INT_ENR_AVAILABLE                  1
#define FM0P_CRG_INT_STR_AVAILABLE                1
#define FM_CRG_INT_STR_AVAILABLE                  1
#define FM0P_CRG_PLL_CTL1_AVAILABLE               1
#define FM_CRG_PLL_CTL1_AVAILABLE                 1
#define FM0P_CRG_PLL_CTL2_AVAILABLE               1
#define FM_CRG_PLL_CTL2_AVAILABLE                 1
#define FM0P_CRG_PSW_TMR_AVAILABLE                1
#define FM_CRG_PSW_TMR_AVAILABLE                  1
#define FM0P_CRG_RST_STR_AVAILABLE                1
#define FM_CRG_RST_STR_AVAILABLE                  1
#define FM0P_CRG_SCM_CTL_AVAILABLE                1
#define FM_CRG_SCM_CTL_AVAILABLE                  1
#define FM0P_CRG_SCM_STR_AVAILABLE                1
#define FM_CRG_SCM_STR_AVAILABLE                  1
#define FM0P_CRG_STB_CTL_AVAILABLE                1
#define FM_CRG_STB_CTL_AVAILABLE                  1
#define FM0P_CRG_SWC_PSR_AVAILABLE                1
#define FM_CRG_SWC_PSR_AVAILABLE                  1
/*******************************************************************************
* CRTRIM
*******************************************************************************/
#define FM0P_CRTRIM_MCR_FTRM_AVAILABLE            1
#define FM_CRTRIM_MCR_FTRM_AVAILABLE              1
#define FM0P_CRTRIM_MCR_PSR_AVAILABLE             1
#define FM_CRTRIM_MCR_PSR_AVAILABLE               1
#define FM0P_CRTRIM_MCR_RLR_AVAILABLE             1
#define FM_CRTRIM_MCR_RLR_AVAILABLE               1
#define FM0P_CRTRIM_MCR_TTRM_AVAILABLE            1
#define FM_CRTRIM_MCR_TTRM_AVAILABLE              1
/*******************************************************************************
* DS
*******************************************************************************/
#define FM0P_DS_BUR01_AVAILABLE                   1
#define FM_DS_BUR01_AVAILABLE                     1
#define FM0P_DS_BUR02_AVAILABLE                   1
#define FM_DS_BUR02_AVAILABLE                     1
#define FM0P_DS_BUR03_AVAILABLE                   1
#define FM_DS_BUR03_AVAILABLE                     1
#define FM0P_DS_BUR04_AVAILABLE                   1
#define FM_DS_BUR04_AVAILABLE                     1
#define FM0P_DS_BUR05_AVAILABLE                   1
#define FM_DS_BUR05_AVAILABLE                     1
#define FM0P_DS_BUR06_AVAILABLE                   1
#define FM_DS_BUR06_AVAILABLE                     1
#define FM0P_DS_BUR07_AVAILABLE                   1
#define FM_DS_BUR07_AVAILABLE                     1
#define FM0P_DS_BUR08_AVAILABLE                   1
#define FM_DS_BUR08_AVAILABLE                     1
#define FM0P_DS_BUR09_AVAILABLE                   1
#define FM_DS_BUR09_AVAILABLE                     1
#define FM0P_DS_BUR10_AVAILABLE                   1
#define FM_DS_BUR10_AVAILABLE                     1
#define FM0P_DS_BUR11_AVAILABLE                   1
#define FM_DS_BUR11_AVAILABLE                     1
#define FM0P_DS_BUR12_AVAILABLE                   1
#define FM_DS_BUR12_AVAILABLE                     1
#define FM0P_DS_BUR13_AVAILABLE                   1
#define FM_DS_BUR13_AVAILABLE                     1
#define FM0P_DS_BUR14_AVAILABLE                   1
#define FM_DS_BUR14_AVAILABLE                     1
#define FM0P_DS_BUR15_AVAILABLE                   1
#define FM_DS_BUR15_AVAILABLE                     1
#define FM0P_DS_BUR16_AVAILABLE                   1
#define FM_DS_BUR16_AVAILABLE                     1
#define FM0P_DS_CAL_CTL_AVAILABLE                 1
#define FM_DS_CAL_CTL_AVAILABLE                   1
#define FM0P_DS_CAL_KEY_AVAILABLE                 1
#define FM_DS_CAL_KEY_AVAILABLE                   1
#define FM0P_DS_CEC_CTL_AVAILABLE                 1
#define FM_DS_CEC_CTL_AVAILABLE                   1
#define FM0P_DS_DEBUG_SW_CTL_AVAILABLE            1
#define FM_DS_DEBUG_SW_CTL_AVAILABLE              1
#define FM0P_DS_DSRAMR_AVAILABLE                  1
#define FM_DS_DSRAMR_AVAILABLE                    1
#define FM0P_DS_MOSC_CTL_AVAILABLE                1
#define FM_DS_MOSC_CTL_AVAILABLE                  1
#define FM0P_DS_PMD_CTL_AVAILABLE                 1
#define FM_DS_PMD_CTL_AVAILABLE                   1
#define FM0P_DS_RCK_CTL_AVAILABLE                 1
#define FM_DS_RCK_CTL_AVAILABLE                   1
#define FM0P_DS_REG_CTL_AVAILABLE                 1
#define FM_DS_REG_CTL_AVAILABLE                   1
#define FM0P_DS_SUBOSC_CTL_AVAILABLE              1
#define FM_DS_SUBOSC_CTL_AVAILABLE                1
#define FM0P_DS_WIER_AVAILABLE                    1
#define FM_DS_WIER_AVAILABLE                      1
#define FM0P_DS_WIFSR_AVAILABLE                   1
#define FM_DS_WIFSR_AVAILABLE                     1
#define FM0P_DS_WILVR_AVAILABLE                   1
#define FM_DS_WILVR_AVAILABLE                     1
#define FM0P_DS_WIOLC_CTL_AVAILABLE               1
#define FM_DS_WIOLC_CTL_AVAILABLE                 1
#define FM0P_DS_WRFSR_AVAILABLE                   1
#define FM_DS_WRFSR_AVAILABLE                     1
/*******************************************************************************
* DSTC
*******************************************************************************/
#define FM0P_DSTC_CFG_AVAILABLE                   1
#define FM_DSTC_CFG_AVAILABLE                     1
#define FM0P_DSTC_CMD_AVAILABLE                   1
#define FM_DSTC_CMD_AVAILABLE                     1
#define FM0P_DSTC_DESTP_AVAILABLE                 1
#define FM_DSTC_DESTP_AVAILABLE                   1
#define FM0P_DSTC_DQMSK0_AVAILABLE                1
#define FM_DSTC_DQMSK0_AVAILABLE                  1
#define FM0P_DSTC_DQMSK1_AVAILABLE                1
#define FM_DSTC_DQMSK1_AVAILABLE                  1
#define FM0P_DSTC_DQMSKCLR0_AVAILABLE             1
#define FM_DSTC_DQMSKCLR0_AVAILABLE               1
#define FM0P_DSTC_DQMSKCLR1_AVAILABLE             1
#define FM_DSTC_DQMSKCLR1_AVAILABLE               1
#define FM0P_DSTC_DREQENB0_AVAILABLE              1
#define FM_DSTC_DREQENB0_AVAILABLE                1
#define FM0P_DSTC_DREQENB1_AVAILABLE              1
#define FM_DSTC_DREQENB1_AVAILABLE                1
#define FM0P_DSTC_HWDESP_AVAILABLE                1
#define FM_DSTC_HWDESP_AVAILABLE                  1
#define FM0P_DSTC_HWINT0_AVAILABLE                1
#define FM_DSTC_HWINT0_AVAILABLE                  1
#define FM0P_DSTC_HWINT1_AVAILABLE                1
#define FM_DSTC_HWINT1_AVAILABLE                  1
#define FM0P_DSTC_HWINTCLR0_AVAILABLE             1
#define FM_DSTC_HWINTCLR0_AVAILABLE               1
#define FM0P_DSTC_HWINTCLR1_AVAILABLE             1
#define FM_DSTC_HWINTCLR1_AVAILABLE               1
#define FM0P_DSTC_MONERS_AVAILABLE                1
#define FM_DSTC_MONERS_AVAILABLE                  1
#define FM0P_DSTC_SWTR_AVAILABLE                  1
#define FM_DSTC_SWTR_AVAILABLE                    1
/*******************************************************************************
* DT
*******************************************************************************/
#define FM0P_DT_TIMER1BGLOAD_AVAILABLE            1
#define FM_DT_TIMER1BGLOAD_AVAILABLE              1
#define FM0P_DT_TIMER1CONTROL_AVAILABLE           1
#define FM_DT_TIMER1CONTROL_AVAILABLE             1
#define FM0P_DT_TIMER1INTCLR_AVAILABLE            1
#define FM_DT_TIMER1INTCLR_AVAILABLE              1
#define FM0P_DT_TIMER1LOAD_AVAILABLE              1
#define FM_DT_TIMER1LOAD_AVAILABLE                1
#define FM0P_DT_TIMER1MIS_AVAILABLE               1
#define FM_DT_TIMER1MIS_AVAILABLE                 1
#define FM0P_DT_TIMER1RIS_AVAILABLE               1
#define FM_DT_TIMER1RIS_AVAILABLE                 1
#define FM0P_DT_TIMER1VALUE_AVAILABLE             1
#define FM_DT_TIMER1VALUE_AVAILABLE               1
#define FM0P_DT_TIMER2BGLOAD_AVAILABLE            1
#define FM_DT_TIMER2BGLOAD_AVAILABLE              1
#define FM0P_DT_TIMER2CONTROL_AVAILABLE           1
#define FM_DT_TIMER2CONTROL_AVAILABLE             1
#define FM0P_DT_TIMER2INTCLR_AVAILABLE            1
#define FM_DT_TIMER2INTCLR_AVAILABLE              1
#define FM0P_DT_TIMER2LOAD_AVAILABLE              1
#define FM_DT_TIMER2LOAD_AVAILABLE                1
#define FM0P_DT_TIMER2MIS_AVAILABLE               1
#define FM_DT_TIMER2MIS_AVAILABLE                 1
#define FM0P_DT_TIMER2RIS_AVAILABLE               1
#define FM_DT_TIMER2RIS_AVAILABLE                 1
#define FM0P_DT_TIMER2VALUE_AVAILABLE             1
#define FM_DT_TIMER2VALUE_AVAILABLE               1
/*******************************************************************************
* EXTI
*******************************************************************************/
#define FM0P_EXTI_EICL_AVAILABLE                  1
#define FM_EXTI_EICL_AVAILABLE                    1
#define FM0P_EXTI_EIRR_AVAILABLE                  1
#define FM_EXTI_EIRR_AVAILABLE                    1
#define FM0P_EXTI_ELVR_AVAILABLE                  1
#define FM_EXTI_ELVR_AVAILABLE                    1
#define FM0P_EXTI_ELVR1_AVAILABLE                 1
#define FM_EXTI_ELVR1_AVAILABLE                   1
#define FM0P_EXTI_ELVR2_AVAILABLE                 1
#define FM_EXTI_ELVR2_AVAILABLE                   1
#define FM0P_EXTI_ENIR_AVAILABLE                  1
#define FM_EXTI_ENIR_AVAILABLE                    1
#define FM0P_EXTI_NMICL_AVAILABLE                 1
#define FM_EXTI_NMICL_AVAILABLE                   1
#define FM0P_EXTI_NMIENR_AVAILABLE                1
#define FM_EXTI_NMIENR_AVAILABLE                  1
#define FM0P_EXTI_NMIRR_AVAILABLE                 1
#define FM_EXTI_NMIRR_AVAILABLE                   1
/*******************************************************************************
* FASTIO
*******************************************************************************/
#define FM0P_FASTIO_FPDIR0_AVAILABLE              1
#define FM_FASTIO_FPDIR0_AVAILABLE                1
#define FM0P_FASTIO_FPDIR1_AVAILABLE              1
#define FM_FASTIO_FPDIR1_AVAILABLE                1
#define FM0P_FASTIO_FPDIR2_AVAILABLE              1
#define FM_FASTIO_FPDIR2_AVAILABLE                1
#define FM0P_FASTIO_FPDIR3_AVAILABLE              1
#define FM_FASTIO_FPDIR3_AVAILABLE                1
#define FM0P_FASTIO_FPDIR4_AVAILABLE              1
#define FM_FASTIO_FPDIR4_AVAILABLE                1
#define FM0P_FASTIO_FPDIR5_AVAILABLE              1
#define FM_FASTIO_FPDIR5_AVAILABLE                1
#define FM0P_FASTIO_FPDIR6_AVAILABLE              1
#define FM_FASTIO_FPDIR6_AVAILABLE                1
#define FM0P_FASTIO_FPDIR7_AVAILABLE              1
#define FM_FASTIO_FPDIR7_AVAILABLE                1
#define FM0P_FASTIO_FPDIR8_AVAILABLE              1
#define FM_FASTIO_FPDIR8_AVAILABLE                1
#define FM0P_FASTIO_FPDIR9_AVAILABLE              1
#define FM_FASTIO_FPDIR9_AVAILABLE                1
#define FM0P_FASTIO_FPDIRA_AVAILABLE              1
#define FM_FASTIO_FPDIRA_AVAILABLE                1
#define FM0P_FASTIO_FPDIRB_AVAILABLE              1
#define FM_FASTIO_FPDIRB_AVAILABLE                1
#define FM0P_FASTIO_FPDIRC_AVAILABLE              1
#define FM_FASTIO_FPDIRC_AVAILABLE                1
#define FM0P_FASTIO_FPDIRD_AVAILABLE              1
#define FM_FASTIO_FPDIRD_AVAILABLE                1
#define FM0P_FASTIO_FPDIRE_AVAILABLE              1
#define FM_FASTIO_FPDIRE_AVAILABLE                1
#define FM0P_FASTIO_FPDIRF_AVAILABLE              1
#define FM_FASTIO_FPDIRF_AVAILABLE                1
#define FM0P_FASTIO_FPDOR0_AVAILABLE              1
#define FM_FASTIO_FPDOR0_AVAILABLE                1
#define FM0P_FASTIO_FPDOR1_AVAILABLE              1
#define FM_FASTIO_FPDOR1_AVAILABLE                1
#define FM0P_FASTIO_FPDOR2_AVAILABLE              1
#define FM_FASTIO_FPDOR2_AVAILABLE                1
#define FM0P_FASTIO_FPDOR3_AVAILABLE              1
#define FM_FASTIO_FPDOR3_AVAILABLE                1
#define FM0P_FASTIO_FPDOR4_AVAILABLE              1
#define FM_FASTIO_FPDOR4_AVAILABLE                1
#define FM0P_FASTIO_FPDOR5_AVAILABLE              1
#define FM_FASTIO_FPDOR5_AVAILABLE                1
#define FM0P_FASTIO_FPDOR6_AVAILABLE              1
#define FM_FASTIO_FPDOR6_AVAILABLE                1
#define FM0P_FASTIO_FPDOR7_AVAILABLE              1
#define FM_FASTIO_FPDOR7_AVAILABLE                1
#define FM0P_FASTIO_FPDOR8_AVAILABLE              1
#define FM_FASTIO_FPDOR8_AVAILABLE                1
#define FM0P_FASTIO_FPDOR9_AVAILABLE              1
#define FM_FASTIO_FPDOR9_AVAILABLE                1
#define FM0P_FASTIO_FPDORA_AVAILABLE              1
#define FM_FASTIO_FPDORA_AVAILABLE                1
#define FM0P_FASTIO_FPDORB_AVAILABLE              1
#define FM_FASTIO_FPDORB_AVAILABLE                1
#define FM0P_FASTIO_FPDORC_AVAILABLE              1
#define FM_FASTIO_FPDORC_AVAILABLE                1
#define FM0P_FASTIO_FPDORD_AVAILABLE              1
#define FM_FASTIO_FPDORD_AVAILABLE                1
#define FM0P_FASTIO_FPDORE_AVAILABLE              1
#define FM_FASTIO_FPDORE_AVAILABLE                1
#define FM0P_FASTIO_FPDORF_AVAILABLE              1
#define FM_FASTIO_FPDORF_AVAILABLE                1
#define FM0P_FASTIO_M_FPDIR0_AVAILABLE            1
#define FM_FASTIO_M_FPDIR0_AVAILABLE              1
#define FM0P_FASTIO_M_FPDIR1_AVAILABLE            1
#define FM_FASTIO_M_FPDIR1_AVAILABLE              1
#define FM0P_FASTIO_M_FPDOR0_AVAILABLE            1
#define FM_FASTIO_M_FPDOR0_AVAILABLE              1
#define FM0P_FASTIO_M_FPDOR1_AVAILABLE            1
#define FM_FASTIO_M_FPDOR1_AVAILABLE              1
/*******************************************************************************
* FLASH_IF
*******************************************************************************/
#define FM0P_FLASH_IF_CRTRMM_AVAILABLE            1
#define FM_FLASH_IF_CRTRMM_AVAILABLE              1
#define FM0P_FLASH_IF_FICLR_AVAILABLE             1
#define FM_FLASH_IF_FICLR_AVAILABLE               1
#define FM0P_FLASH_IF_FICR_AVAILABLE              1
#define FM_FLASH_IF_FICR_AVAILABLE                1
#define FM0P_FLASH_IF_FISR_AVAILABLE              1
