MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12B0AGN20000/mcu.h
/*******************************************************************************
* HDMICEC Registers HDMICEC0
*   Bitband Section
*******************************************************************************/
#define bFM_HDMICEC0_RCCKD_CKSEL                  *((volatile  uint16_t*)(0x42680B30UL))
#define bFM0P_HDMICEC0_RCCKD_CKSEL                *((volatile  uint16_t*)(0x42680B30UL))

#define bFM_HDMICEC0_RCCR_EN                      *((volatile  uint8_t *)(0x42680820UL))
#define bFM0P_HDMICEC0_RCCR_EN                    *((volatile  uint8_t *)(0x42680820UL))
#define bFM_HDMICEC0_RCCR_ADRCE                   *((volatile  uint8_t *)(0x4268082CUL))
#define bFM0P_HDMICEC0_RCCR_ADRCE                 *((volatile  uint8_t *)(0x4268082CUL))
#define bFM_HDMICEC0_RCCR_THSEL                   *((volatile  uint8_t *)(0x4268083CUL))
#define bFM0P_HDMICEC0_RCCR_THSEL                 *((volatile  uint8_t *)(0x4268083CUL))

#define bFM_HDMICEC0_RCLE_LES                     *((volatile  uint8_t *)(0x42680C20UL))
#define bFM0P_HDMICEC0_RCLE_LES                   *((volatile  uint8_t *)(0x42680C20UL))
#define bFM_HDMICEC0_RCLE_LEL                     *((volatile  uint8_t *)(0x42680C24UL))
#define bFM0P_HDMICEC0_RCLE_LEL                   *((volatile  uint8_t *)(0x42680C24UL))
#define bFM_HDMICEC0_RCLE_EPE                     *((volatile  uint8_t *)(0x42680C2CUL))
#define bFM0P_HDMICEC0_RCLE_EPE                   *((volatile  uint8_t *)(0x42680C2CUL))
#define bFM_HDMICEC0_RCLE_LESE                    *((volatile  uint8_t *)(0x42680C30UL))
#define bFM0P_HDMICEC0_RCLE_LESE                  *((volatile  uint8_t *)(0x42680C30UL))
#define bFM_HDMICEC0_RCLE_LELE                    *((volatile  uint8_t *)(0x42680C34UL))
#define bFM0P_HDMICEC0_RCLE_LELE                  *((volatile  uint8_t *)(0x42680C34UL))
#define bFM_HDMICEC0_RCLE_LESIE                   *((volatile  uint8_t *)(0x42680C38UL))
#define bFM0P_HDMICEC0_RCLE_LESIE                 *((volatile  uint8_t *)(0x42680C38UL))
#define bFM_HDMICEC0_RCLE_LELIE                   *((volatile  uint8_t *)(0x42680C3CUL))
#define bFM0P_HDMICEC0_RCLE_LELIE                 *((volatile  uint8_t *)(0x42680C3CUL))

#define bFM_HDMICEC0_RCRC_RC                      *((volatile  uint8_t *)(0x42680BA0UL))
#define bFM0P_HDMICEC0_RCRC_RC                    *((volatile  uint8_t *)(0x42680BA0UL))
#define bFM_HDMICEC0_RCRC_RCIE                    *((volatile  uint8_t *)(0x42680BB0UL))
#define bFM0P_HDMICEC0_RCRC_RCIE                  *((volatile  uint8_t *)(0x42680BB0UL))

#define bFM_HDMICEC0_RCST_OVF                     *((volatile  uint8_t *)(0x42680800UL))
#define bFM0P_HDMICEC0_RCST_OVF                   *((volatile  uint8_t *)(0x42680800UL))
#define bFM_HDMICEC0_RCST_EOM                     *((volatile  uint8_t *)(0x42680804UL))
#define bFM0P_HDMICEC0_RCST_EOM                   *((volatile  uint8_t *)(0x42680804UL))
#define bFM_HDMICEC0_RCST_ACK                     *((volatile  uint8_t *)(0x42680808UL))
#define bFM0P_HDMICEC0_RCST_ACK                   *((volatile  uint8_t *)(0x42680808UL))
#define bFM_HDMICEC0_RCST_ST                      *((volatile  uint8_t *)(0x4268080CUL))
#define bFM0P_HDMICEC0_RCST_ST                    *((volatile  uint8_t *)(0x4268080CUL))
#define bFM_HDMICEC0_RCST_OVFSEL                  *((volatile  uint8_t *)(0x42680810UL))
#define bFM0P_HDMICEC0_RCST_OVFSEL                *((volatile  uint8_t *)(0x42680810UL))
#define bFM_HDMICEC0_RCST_OVFIE                   *((volatile  uint8_t *)(0x42680814UL))
#define bFM0P_HDMICEC0_RCST_OVFIE                 *((volatile  uint8_t *)(0x42680814UL))
#define bFM_HDMICEC0_RCST_ACKIE                   *((volatile  uint8_t *)(0x42680818UL))
#define bFM0P_HDMICEC0_RCST_ACKIE                 *((volatile  uint8_t *)(0x42680818UL))
#define bFM_HDMICEC0_RCST_STIE                    *((volatile  uint8_t *)(0x4268081CUL))
#define bFM0P_HDMICEC0_RCST_STIE                  *((volatile  uint8_t *)(0x4268081CUL))

#define bFM_HDMICEC0_TXCTRL_TXEN                  *((volatile  uint8_t *)(0x42680000UL))
#define bFM0P_HDMICEC0_TXCTRL_TXEN                *((volatile  uint8_t *)(0x42680000UL))
#define bFM_HDMICEC0_TXCTRL_START                 *((volatile  uint8_t *)(0x42680008UL))
#define bFM0P_HDMICEC0_TXCTRL_START               *((volatile  uint8_t *)(0x42680008UL))
#define bFM_HDMICEC0_TXCTRL_EOM                   *((volatile  uint8_t *)(0x4268000CUL))
#define bFM0P_HDMICEC0_TXCTRL_EOM                 *((volatile  uint8_t *)(0x4268000CUL))
#define bFM_HDMICEC0_TXCTRL_ITSTEN                *((volatile  uint8_t *)(0x42680010UL))
#define bFM0P_HDMICEC0_TXCTRL_ITSTEN              *((volatile  uint8_t *)(0x42680010UL))
#define bFM_HDMICEC0_TXCTRL_IBREN                 *((volatile  uint8_t *)(0x42680014UL))
#define bFM0P_HDMICEC0_TXCTRL_IBREN               *((volatile  uint8_t *)(0x42680014UL))

#define bFM_HDMICEC0_TXSTS_ACKSV                  *((volatile  uint8_t *)(0x42680100UL))
#define bFM0P_HDMICEC0_TXSTS_ACKSV                *((volatile  uint8_t *)(0x42680100UL))
#define bFM_HDMICEC0_TXSTS_ITST                   *((volatile  uint8_t *)(0x42680110UL))
#define bFM0P_HDMICEC0_TXSTS_ITST                 *((volatile  uint8_t *)(0x42680110UL))
#define bFM_HDMICEC0_TXSTS_IBR                    *((volatile  uint8_t *)(0x42680114UL))
#define bFM0P_HDMICEC0_TXSTS_IBR                  *((volatile  uint8_t *)(0x42680114UL))


/*******************************************************************************
* HDMICEC Registers HDMICEC1
*   Bitband Section
*******************************************************************************/
#define bFM_HDMICEC1_RCCKD_CKSEL                  *((volatile  uint16_t*)(0x42682B30UL))
#define bFM0P_HDMICEC1_RCCKD_CKSEL                *((volatile  uint16_t*)(0x42682B30UL))

#define bFM_HDMICEC1_RCCR_EN                      *((volatile  uint8_t *)(0x42682820UL))
#define bFM0P_HDMICEC1_RCCR_EN                    *((volatile  uint8_t *)(0x42682820UL))
#define bFM_HDMICEC1_RCCR_ADRCE                   *((volatile  uint8_t *)(0x4268282CUL))
#define bFM0P_HDMICEC1_RCCR_ADRCE                 *((volatile  uint8_t *)(0x4268282CUL))
#define bFM_HDMICEC1_RCCR_THSEL                   *((volatile  uint8_t *)(0x4268283CUL))
#define bFM0P_HDMICEC1_RCCR_THSEL                 *((volatile  uint8_t *)(0x4268283CUL))

#define bFM_HDMICEC1_RCLE_LES                     *((volatile  uint8_t *)(0x42682C20UL))
#define bFM0P_HDMICEC1_RCLE_LES                   *((volatile  uint8_t *)(0x42682C20UL))
#define bFM_HDMICEC1_RCLE_LEL                     *((volatile  uint8_t *)(0x42682C24UL))
#define bFM0P_HDMICEC1_RCLE_LEL                   *((volatile  uint8_t *)(0x42682C24UL))
#define bFM_HDMICEC1_RCLE_EPE                     *((volatile  uint8_t *)(0x42682C2CUL))
#define bFM0P_HDMICEC1_RCLE_EPE                   *((volatile  uint8_t *)(0x42682C2CUL))
#define bFM_HDMICEC1_RCLE_LESE                    *((volatile  uint8_t *)(0x42682C30UL))
#define bFM0P_HDMICEC1_RCLE_LESE                  *((volatile  uint8_t *)(0x42682C30UL))
#define bFM_HDMICEC1_RCLE_LELE                    *((volatile  uint8_t *)(0x42682C34UL))
#define bFM0P_HDMICEC1_RCLE_LELE                  *((volatile  uint8_t *)(0x42682C34UL))
#define bFM_HDMICEC1_RCLE_LESIE                   *((volatile  uint8_t *)(0x42682C38UL))
#define bFM0P_HDMICEC1_RCLE_LESIE                 *((volatile  uint8_t *)(0x42682C38UL))
#define bFM_HDMICEC1_RCLE_LELIE                   *((volatile  uint8_t *)(0x42682C3CUL))
#define bFM0P_HDMICEC1_RCLE_LELIE                 *((volatile  uint8_t *)(0x42682C3CUL))

#define bFM_HDMICEC1_RCRC_RC                      *((volatile  uint8_t *)(0x42682BA0UL))
#define bFM0P_HDMICEC1_RCRC_RC                    *((volatile  uint8_t *)(0x42682BA0UL))
#define bFM_HDMICEC1_RCRC_RCIE                    *((volatile  uint8_t *)(0x42682BB0UL))
#define bFM0P_HDMICEC1_RCRC_RCIE                  *((volatile  uint8_t *)(0x42682BB0UL))

